# NextDObj

## Description
Function NextDObj returns the next deselected object after the referenced object in a list. If the end of the list is reached, the function returns NIL.

```pascal
FUNCTION NextDObj(h : HANDLE): HANDLE;
```

```python
def vs.NextDObj(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Examples
==== VectorScript ====
```pascal
handleToObject:=FObject;
WHILE handleToObject &lt;&gt; NIL DO BEGIN
SetSelect(handleToObject);
handleToObject:=NextDObj(handleToObject);
END;
{ selects all deselected objects }
```
==== Python ====
```python

```

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling